# Importing the libraries

In [ ]:
# NumPy -> To perform the Mathematical operations
import numpy as np

# Pandas -> Data Manipulation tool
import pandas as pd

# Matplotlib -> Data Visualisation tool
import matplotlib.pyplot as plt

# Seaborn -> Data Visualisation tool
import seaborn as sns

# SQLite -> Server-less Database
import sqlite3

# Hints & Tips

1. Establishing the connection to the database

In [ ]:
db = '/content/drive/MyDrive/Datasets/movies.sqlite'
conn = sqlite3.connect(db)
cur = conn.cursor()

2. Get all the data about movies

In [ ]:
# Fetching the data of the Movies table from the Database
cur.execute("SELECT * FROM movies")
# Creating the cursor object
movies = cur.fetchall()

In [ ]:
# Creating a DataFrame
movies = pd.DataFrame(movies,columns=['id', 'original_title', 'budget', 'popularity',
                                  'release_date', 'revenue', 'title', 'vote_average',
                                  'vote_count', 'overview', 'tagline','uid',
                                  'director_id'] )

In [ ]:
# Displaying the DataFrame
movies

         id                            Original_title  ...  uid  director_id
0     43597                                    Avatar  ...  NaN         4762
1     43598  Pirates of the Caribbean: At World's End  ...  NaN         4763
2     43599                                   Spectre  ...  NaN         4764
3     43600                     The Dark Knight Rises  ...  NaN         4765
4     43601                               John Carter  ...  NaN         4766
...     ...                                       ...  ...  ...          ...
4768  48395                               El Mariachi  ...  NaN         5097
4769  48396                                 Newlyweds  ...  NaN         6485
4770  48397                 Signed, Sealed, Delivered  ...  NaN         7108
4771  48398                          Shanghai Calling  ...  NaN         7109
4772  48399                         My Date with Drew  ...  NaN         7110

[4773 rows x 13 columns]

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4773 entries, 0 to 4772
Data columns (total 13 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              4773 non-null   int64
 1   Original_title  4773 non-null   object
 2   Budget          4773 non-null   int64
 3   Popularity      4773 non-null   int64
 4   Release_date    4773 non-null   object
 5   Revenue         4773 non-null   int64
 6   Title           4773 non-null   object
 7   Avg_ratings     4773 non-null   float64
 8   Rating_count    4773 non-null   int64
 9   Overview        4770 non-null   object
 10  Tagline         3951 non-null   object
 11  UID             4773 non-null   int64
 12  director_id     4773 non-null   int64
dtypes: float64(1), int64(7), object(5)
memory usage: 484.9+ KB

3. Get all the data about directors

In [ ]:
# Fetching the data of the Director table from the Database
cur.execute("SELECT * FROM directors")
# Creating the cursor object
directors = cur.fetchall()

In [ ]:
directors

In [ ]:
directors = pd.DataFrame(directors,columns=['name', 'id', 'gender', 'uid',
                                  'department'] )

In [ ]:
directors

                   name    id  gender      uid department
0         James Cameron  4762       2     2710  Directing
1        Gore Verbinski  4763       2     1704  Directing
2            Sam Mendes  4764       2       39  Directing
3     Christopher Nolan  4765       2      525  Directing
4        Andrew Stanton  4766       2        7  Directing
...                 ...   ...     ...      ...        ...
2344      Shane Carruth  7106       2    76624  Directing
2345   Neill Dela Llana  7107       0  1174437  Directing
2346        Scott Smith  7108       0  1219158  Directing
2347        Daniel Hsia  7109       2   208138  Directing
2348   Brian Herzlinger  7110       2    85563  Directing

[2349 rows x 5 columns]

In [ ]:
directors.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2349 entries, 0 to 2348
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        2349 non-null   object
 1   id          2349 non-null   int64
 2   gender      2349 non-null   int64
 3   uid         2349 non-null   int64
 4   department  2349 non-null   object
dtypes: int64(3), object(2)
memory usage: 91.9+ KB

4. Check how many movies are present in the IMDB table

In [ ]:
cur.execute('SELECT COUNT(Title) FROM movies')
count = cur.fetchall()
print(f"The number of movies present in the IMDB databse is {count[0]}")

The number of movies present in the IMDB databse is (4773,)

5. Find these 3 directors: James Cameron, Luc Besson, John Woo

In [ ]:
cur.execute("SELECT * FROM directors WHERE name IN ('James Cameron','Luc Besson', 'John Woo')")
cur.execute("SELECT * FROM directors WHERE name =='James Cameron' or name =='Luc Besson' or name == 'John Woo'")
three_directors = cur.fetchall()
print(f"Theses 3 Directors data are: {three_directors}")

Theses 3 Directors data are: [('James Cameron', 4762, 2, 2710, 'Directing'), ('John Woo', 4893, 2, 11401, 'Directing'), ('Luc Besson', 4949, 2, 59, 'Directing')]

6. Find all the directors with name starting with 'Steven'

In [ ]:
cur.execute('SELECT * FROM directors WHERE name LIKE "Steven%"')
name_like = cur.fetchall()
print(f"The directors whose names are starting with the word 'Steven' are: {name_like}")

The directors whose names are starting with the word 'Steven' are: [('Steven Spielberg', 4799, 2, 488, 'Directing'), ('Steven Soderbergh', 4909, 2, 1884, 'Directing'), ('Steven Brill', 5013, 2, 32593, 'Directing'), ('Steven Zaillian', 5117, 2, 2260, 'Directing'), ('Steven Quale', 5216, 2, 93214, 'Directing'), ('Steven Seagal', 5221, 2, 23880, 'Directing'), ('Steven E. de Souza', 5390, 2, 1726, 'Directing'), ('Steven Shainberg', 5803, 2, 67795, 'Directing'), ('Steven R. Monroe', 6713, 2, 88039, 'Directing')]

7. Count the Female directors

In [ ]:
cur.execute("SELECT COUNT(*) FROM directors WHERE gender == '1'")
females = cur.fetchall()
print(f"The number of female directors is {females[0][0]}")

The number of female directors is 150

8. Find the name of the 10th first women directors

In [ ]:
cur.execute('SELECT name FROM directors WHERE gender==1')
tenth = cur.fetchall()
print(f"The tenth first women is {tenth[9][0]}")

The tenth first women is Angelina Jolie

9. What are the 3 most popular movies?

In [ ]:
cur.execute('SELECT title FROM movies ORDER BY popularity DESC LIMIT 3 ')
most_popular = cur.fetchall()
print(f"The 3 mostpopular movies are: {most_popular[0][0]}, {most_popular[1][0]} and {most_popular[2][0]}")

The 3 mostpopular movies are: Minions, Interstellar and Deadpool

10. What are the 3 most bankable movies?

In [ ]:
cur.execute('SELECT title FROM movies ORDER BY budget DESC LIMIT 3')
most_bankable = cur.fetchall()
most_bankable
print(f"The three most bankable movies are {most_bankable[0][0]}, {most_bankable[1][0]} and {most_bankable[2][0]}")

The three most bankable movies are Pirates of the Caribbean: On Stranger Tides, Pirates of the Caribbean: At World's End and Avengers: Age of Ultron

11. What is the most awarded average rated movie since the Jan 1st, 2000?

In [ ]:
cur.execute("SELECT Original_title FROM movies WHERE Release_date	 > '2000-01-01' ORDER BY vote_average DESC LIMIT 1")
most_awarded_avg = cur.fetchall()
print(f"The most awarded average rated movie is {most_awarded_avg[0][0]}")

The most awarded average rated movie is Sardaarji

12. Which movie(s) were directed by Brenda Chapman?

In [ ]:
cur.execute("SELECT original_title FROM movies JOIN directors ON directors.id = movies.director_id WHERE directors.name = 'Brenda Chapman'")
directed_by = cur.fetchall()
print(f"The movie(s) directed by Brenda Chapman is {directed_by[0][0]}")

The movie(s) directed by Brenda Chapman is Brave

13. Name the director who has made the most movies?

In [ ]:
cur.execute("SELECT name FROM directors JOIN movies ON directors.id = movies.director_id GROUP BY director_id ORDER BY COUNT(name) DESC limit 1")
director_movie = cur.fetchall()
print(f"The director who made the most movies is {director_movie[0][0]}")

The director who made the most movies is Steven Spielberg

14. Name of the director who is most bankable

In [ ]:
cur.execute("SELECT name FROM directors JOIN movies ON directors.id = movies.director_id GROUP BY director_id ORDER BY SUM(budget) DESC limit 1")
most_bankable = cur.fetchall()
print(f'The most bankable director is {most_bankable[0][0]}')

The most bankable director is Steven Spielberg

# Budget Analysis

1. Tell the Top 10 highest budget making movie

In [ ]:
movies.columns

Index(['id', 'original_title', 'budget', 'popularity', 'release_date',
       'revenue', 'title', 'vote_average', 'vote_count', 'overview', 'tagline',
       'uid', 'director_id'],
      dtype='object')

In [ ]:
cur.execute('Select * FROM movies ORDER BY budget DESC LIMIT 10')
top_10 = cur.fetchall()
most_popular = pd.DataFrame(top_10, columns=['id', 'original_title', 'budget', 'popularity', 'release_date',
       'revenue', 'title', 'vote_average', 'vote_count', 'overview', 'tagline',
       'uid', 'director_id'])
most_popular

      id                               original_title  ...    uid  director_id
0  43614  Pirates of the Caribbean: On Stranger Tides  ...   1865         4775
1  43598     Pirates of the Caribbean: At World's End  ...    285         4763
2  43604                      Avengers: Age of Ultron  ...  99861         4769
3  43607                             Superman Returns  ...   1452         4772
4  43601                                  John Carter  ...  49529         4766
5  43603                                      Tangled  ...  38757         4768
6  43602                                 Spider-Man 3  ...    559         4767
7  43610                              The Lone Ranger  ...  57201         4763
8  43600                        The Dark Knight Rises  ...  49026         4765
9  43605       Harry Potter and the Half-Blood Prince  ...    767         4770

[10 rows x 13 columns]

# Revenue Analysis

1. Find Top 10 Revenue making movies

In [ ]:
cur.execute("SELECT * FROM movies ORDER BY revenue DESC LIMIT 10")
top10_movies = cur.fetchall()
most_revenue = pd.DataFrame(top10_movies,  columns= ['id','original_title','budget','popularity','release_date',
                                    'revenue', 'title','vote_average','vote_count','overview',
                                    'tagline','uid','director_id'])
most_revenue

      id              original_title  ...     uid  director_id
0  43597                      Avatar  ...   19995         4762
1  43622                     Titanic  ...     597         4762
2  43613                The Avengers  ...   24428         4769
3  43625              Jurassic World  ...  135397         4783
4  43641                   Furious 7  ...  168259         4794
5  43604     Avengers: Age of Ultron  ...   99861         4769
6  43721                      Frozen  ...  109445         4844
7  43628                  Iron Man 3  ...   68721         4784
8  44143                     Minions  ...  211672         5045
9  43623  Captain America: Civil War  ...  271110         4781

[10 rows x 13 columns]

# Voting Analysis

1. Find the most popular movies with highest vote_average

In [ ]:
cur.execute(("SELECT * FROM movies ORDER BY vote_average DESC LIMIT 10"))
most_pop = cur.fetchall() 
most_popular_movie = pd.DataFrame(most_pop,columns =['id', 'original_title', 'budget', 'popularity', 'release_date',
       'revenue', 'title', 'vote_average', 'vote_count', 'overview', 'tagline',
       'uid', 'director_id'])
most_popular_movie

      id            original_title  ...     uid  director_id
0  47116          Stiff Upper Lips  ...   89861         6332
1  47642     Dancer, Texas Pop. 81  ...   78373         5463
2  47589                 Sardaarji  ...  346081         6588
3  45983            One Man's Hero  ...   69848         5770
4  45478  The Shawshank Redemption  ...     278         5051
5  46567        There Goes My Baby  ...   88641         6051
6  46393     The Prisoner of Zenda  ...   43867         5972
7  46934             The Godfather  ...     238         5179
8  44259                Fight Club  ...     550         4829
9  45415          Schindler's List  ...     424         4799

[10 rows x 13 columns]

# Director Analysis

1. Name all the directors with the number of movies and revenue where Revenue should be taken into account for doing the analysis. The director who has the highest revenue should comes at the top and so on and so forth.

In [ ]:
cur.execute("SELECT name,COUNT(*) AS 'Total Movies',SUM(revenue) AS 'Total Revenue' FROM  directors JOIN movies WHERE directors.id==movies.director_id GROUP BY director_id ORDER BY SUM(revenue) DESC")
director_revenue=cur.fetchall()
director_most_revenue=pd.DataFrame(director_revenue,columns=['Director_Name','Total Movies','Total Revenue'])
director_most_revenue.head(10)

       Director_Name  Total Movies  Total Revenue
0   Steven Spielberg            27     9147393164
1      Peter Jackson             9     6498642820
2      James Cameron             7     5883569439
3        Michael Bay            12     5832524638
4  Christopher Nolan             8     4227483234
5     Chris Columbus            11     3725631503
6    Robert Zemeckis            13     3590622002
7       George Lucas             5     3339113893
8         Tim Burton            14     3337418241
9       Ridley Scott            16     3189557997

2. Name all the directors with the number of movies and revenue where number of movies should be taken into account for doing the analysis. The director who has the highest number of movies should comes at the top and so on and so forth.

In [ ]:
cur.execute("SELECT name, COUNT(title), SUM(revenue) FROM directors JOIN movies ON movies.director_id = directors.id GROUP by director_id ORDER BY  COUNT(title) DESC LIMIT 10")
director_movies = cur.fetchall()
director_most_movies = pd.DataFrame(director_movies,columns=['name','no_of_title','revenue'])
director_most_movies

                name  no_of_title     revenue
0   Steven Spielberg           27  9147393164
1        Woody Allen           21   669101038
2    Martin Scorsese           20  1956635998
3     Clint Eastwood           20  2512058888
4       Ridley Scott           16  3189557997
5   Robert Rodriguez           16  1109899581
6          Spike Lee           16   340618771
7  Steven Soderbergh           15  2114864443
8       Renny Harlin           15  1031500590
9         Tim Burton           14  3337418241

3. Give the Title of the movie, realease_date, budget, revenue, popularity and vote_average made by Steven Spielberg

In [ ]:
cur.execute("SELECT title, release_date,budget,revenue,popularity,vote_average FROM directors JOIN movies ON directors.id==movies.director_id WHERE directors.name=='Steven Spielberg'")
movies_list=cur.fetchall()
movies_list_Steven_Spielberg=pd.DataFrame(movies_list,columns=['Movie_Name','Release_Date','Total Budget','Total_Revenue','Popularity','Vote_Average'])
movies_list_Steven_Spielberg

                                           Movie_Name  ... Vote_Average
0   Indiana Jones and the Kingdom of the Crystal S...  ...          5.7
1                                             The BFG  ...          6.0
2                                   War of the Worlds  ...          6.2
3                            The Adventures of Tintin  ...          6.7
4                                     Minority Report  ...          7.1
5                        A.I. Artificial Intelligence  ...          6.8
6                       The Lost World: Jurassic Park  ...          6.2
7                                        The Terminal  ...          7.0
8                                              Munich  ...          6.9
9                                                Hook  ...          6.6
10                                          War Horse  ...          7.0
11                                Saving Private Ryan  ...          7.9
12                                            Lincoln  ...          6.7
13                                      Jurassic Park  ...          7.6
14                                Catch Me If You Can  ...          7.7
15                 Indiana Jones and the Last Crusade  ...          7.6
16                                    Bridge of Spies  ...          7.2
17                                            Amistad  ...          6.8
18                                               1941  ...          5.6
19               Indiana Jones and the Temple of Doom  ...          7.1
20                                   Schindler's List  ...          8.3
21                            Raiders of the Lost Ark  ...          7.7
22                 Close Encounters of the Third Kind  ...          7.2
23                                   The Color Purple  ...          7.7
24                                               Jaws  ...          7.5
25                         E.T. the Extra-Terrestrial  ...          7.3
26                           Twilight Zone: The Movie  ...          6.2

[27 rows x 6 columns]